'''
	变量 variable
	1. 定义
	2. 格式
	3. 命名要求
	4. 变量操作
'''

# 1. 定义
# 	用于存储数据, 相当于数学中学的 "未知数", 并指向一个内存


# 2. 格式
# 	2.1 变量名 = 值
# 	2.2 变量名1 = 变量名2 = 变量名3 = ... = 值
# 	2.3 未定义的变量: 没有值的变量

# 2.1 
name = '红猫'
print( name )
print( id(name) ) 	# id() 	获取当前变量的内存地址
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 2.2 
a = b = c = d = 100 	# 多个变量 都指向一个内存地址
print(a)
print(b)
print(id(a))
print(id(b))
print(id(c))
print(id(d))

# 2.3 
# print(x) 	# 如果直接使用未定义变量, 则报错 (没有内存)

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')



# 3. 命名要求
# 	3.1 由数字, 字母和下划线组成
# 	3.2 支持中文, 但不推荐
# 	3.3 不能以数字开头
# 	3.4 不能与关键字重名 (关键字: python系统自带的字母单词)
# 	3.5 严格区分大小写

# 3.1
address = '召唤师峡谷'
name1 = '大小姐'
_desc = '喜欢一炮定江山'
print(address, name1, _desc)

# 3.2
刘备 = '搞定了大小姐, 就搞定了江山'
print(刘备)

# 3.3
# 2B = '赵日天'

# 3.4
# 	查看有哪些关键字
# import keyword
# print(keyword.kwlist)

# for = 100 	# 不能使用关键字做 变量名
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 3.5 严格区分大小写
a = 100
print(a)
# print(A)

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')



# 4. 变量操作
# 	4.1 修改变量
# 	4.2 删除变量

name = '苍老师'

# 4.1 
# 	变量名已存在, 就是修改
# 	变量名不存在, 就是新增
name = '波老师'
print(name)

age = 18
print(age)

# 4.2 通过关键字 del 来删除
a = b = c = d = 100
print(a,b,c,d)

del a
# print(a)

del b,c 		# 删除多个变量时, 每个变量之间用 , 隔开
# print(b,c,d)
print(d)


