'''
	列表 list
	1. 定义
	2. 格式
	3. 基本操作
	4. 高级操作
	5. 遍历
	6. 嵌套列表
	7. 推导式
'''

# 5. 遍历
# 	5.1 while遍历
# 	5.2 for_in遍历


# 1. 遍历1
#    0    		1 		2 			3 		4 		5
a = ['史珍香', '魏生津', '杜子腾', '毕云涛', '郝爽', '范建']

i = 0
while i < 6:
	print(i, a[i]) 
	i += 1

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

for i in range(6):
	print(i, a[i])

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

length = len(a) 	# 统计 对象的长度或总数
print(length)

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')
for i in range( len(a) ):
	print(i, a[i])
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 遍历2
#    0    		1 		2 			3 		4 		5
a = ['史珍香', '魏生津', '杜子腾', '毕云涛', '郝爽', '范建']

for i in a:
	print(i,  a.index(i)  ) 	# 对象.index(值)  能获取到值的索引

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')



# 6. 嵌套列表
a = [ [],[],[],[]  ]
print(a, type(a))

a = [ ['貂蝉','西施'], ['熊大','熊二'] ]
print(a[0])
print(a[1])
print(a[0][0]) 	# 访问索引0下的索引为0值
print(a[1][1]) 	# 访问索引1下的索引为1值
print(a[1][0]) 	# 访问索引1下的索引为0值
# 小结: 当有多层列表时, 想要访问其中某一层列表值, 那么就用几个[]
#  					   3层列表中的值, 就用3个[]
#  					   5层列表中的值, 就用5个[]
#  					   ...



# 修改嵌套列表
a[0][1] = '杨玉环'
print(a)

# 删除, 插入 等操作与以上一致, 都是通过索引来操作




















