'''
	元组
	1. 定义
	2. 格式
	3. 基本操作
	4. 高级操作
	5. 元组遍历
'''

# 1. 定义
# 	一组有序的数据组合, 但不能修改数据. 元组属于不可变类型


# 2. 格式
# 	变量名 = (值1, 值2, 值3, ... )

a = () 		# 空元组
print(a, type(a))

a = (10) 		# 若元组中只写一个整数时, 则认为是 int
a = ('abc') 	# 若元组中只写一个字符串时, 则认为是 string
print(a, type(a)) # 以上写法, 会将() 当成数学中(), 作为一个整体来计算. 提高运算优先级

# 真正只有一个值的写法
a = (10, )
print(a, type(a)) 	# 在值1的后面加一个逗号

# 多个值
a = (10,20,30,40)
print(a, type(a))
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')




# 3. 基本操作
# 	3.1 访问元组
# 	3.2 修改元组
# 	3.3 删除元组

#    0  	 1 		 2 		3
a = ('大圣', '天蓬', '卷帘', '金蝉子')
#  	 -4      -3      -2     -1

# 3.1 访问元组, 通过索引来访问
print(a[0])
print(a[-1])
# print(a[999]) 	# 索引不存在时, 则报错

# 3.2 修改元组
# 	因为元组是 不可变类型, 所以无法修改元组
# a[0] = '孙悟空' 	

# 3.3 删除元组
# 	因为元组是 不可变类型, 所以无法删除元组
# del a[0]

# 3.4 元组也不存在插入的写法, 原因同上
# a.insert(0, 'xxx')
# a.append()
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')




# 4. 高级操作
# 	4.1 合并
# 	4.2 重复
# 	4.3 分片
# 	4.4 成员检测

# 4.1 合并
a = ('佛祖', '普度众生')
b = ('达摩', '易筋经')
c = a+b
print(c)

# 4.2 ~ 4.4 自己玩, 与列表 一模一样



# 5. 遍历
a = ('易筋经', '洗髓经', '金钟罩', '童子功')

i = 0
while i < len(a):
	print(i, a[i])
	i += 1

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


for i in range(len(a)):
	print(i, a[i])

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


for i in a:
	print(a.index(i), i)


# 推导式:
# 	元组没有推导式, 但后期可以通过生成器, 来完成类似于推导式的功能










