'''
	运算符
	1. 算术运算符 
	2. 比较运算符 
	3. 赋值运算符 
	4. 逻辑运算符 
	5. 位运算符   	所有运算符中 运算速度最快的
	6. 成员运算符 	
	7. 身份运算符 	
	8. 运算符优先级
'''

# 1. 算术运算符
# 	1.1 基本运算 + - * /
# 	1.2 取模 	%
# 	1.3 幂 		**
# 	1.4 整除 	//

# 1. 基本运算
# ---------------------------------
a = 10
b = 5
print(a+b)
print(a-b)
print(a*b)
print(a/b)
# print(2/0) 	# 第二位数不能为0
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 2. 取模,  取余数
print(10%4)
print(4%10)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

# 2.1 取模结果: 正负取决于第二位数
print(10%4)
print(10%-4)
print(-10%4)
print(-10%-4)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

# 2.2 取模范围: 
# 	%x 				结果: 0 ~ x-1
# 	%(y-x+1) + x	结果: x ~ y

# 结果: 0 ~ 2
print(0%3)
print(1%3)
print(2%3)
print(3%3)
print(4%3)
print(5%3)
print(6%3)

# 结果: 10 ~ 12
print(0%3 + 10)
print(1%3 + 10)
print(2%3 + 10)
print(3%3 + 10)
print(4%3 + 10)
print(9999%3 + 10)


# 结果: 4 ~ 9
print( 4%6 + 4)
print( 5%6 + 4)
print( 6%6 + 4)
print( 7%6 + 4)
print( 8%6 + 4)
print( 9%6 + 4)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 3. 幂
# -----------------------
# 	格式: x ** y   x的y次方
# 	
print( 2 ** 4 ) 	# 2的4次方
print( 2 ** 10 ) 	# 2的10次方
print( 2 ** 7 ) 	# 2的7次方
print( 2 ** 8 ) 	# 2的8次方
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 4. 整除
# ---------------------------
# 	格式: x // y 	求x除以y的整数, 抛弃小数
print( 10 / 4 )
print( 10 // 4 )




