# 
# 逻辑运算符
# 	1. 逻辑与 	and
# 	3. 逻辑或 	or
# 	3. 逻辑非 	not

# 1. 逻辑与
# 	格式:  x and y
# 如果x为真, 那么结果就是y
# 	如果x为假, 那么结果就是x
# 	
# 	与假前, 与真后

x = 5
y = 10
print( x and y )

x = 0
y = 10
print( x and y )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 2. 逻辑或
# 	格式: x or y
# 	
# 	如果x为真, 那么结果就是x
#   如果x为加, 那么结果就是y
#  	
#  	或假后, 或真前

x = 5
y = 10
print( x or y )

x = 0
y = 10
print( x or y )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')



# 3. 逻辑非
# 	格式:  not x
# 	
# 	如果x为真, 那么就是假
# 	如果x为假, 那么就是真
# 	
# 	真即是假, 假即是真

x = 5
print( not x )

x = 0
print( not x )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 小技巧:
# 	逻辑与 和 或 只要记一个
# 	
# 	逻辑或, 只要前面为真, 结果就是真
# 		或真前  => 或假后
# 		与真后  => 与假前


# 4. 混合运算

a = 5
b = 0
print( a and b or b) # 0
print( b and b or a) # 5
print( b or a and b) # 0



