# 
# 位运算
# 	所有的位运算 全部都是二进制的运算
# 	
# 	1. 按位与 		& 	两个为1即为1, 否则就是0
# 	2. 按位或 		| 	一个为1即为1, 否则就是0
# 	3. 按位异或 		^ 	两个不同即为1, 否则就是0  (相异为真, 相同为假)
# 	4. 按位取反 		~x  ===> -x-1
# 	5. 左移 			<<  低位补0, 高位抛弃
# 	6. 右移 			>>  低位抛弃, 高位补0

# 1. 按位与
a = 5 	# 0101
b = 12  # 1100
print( a & b )

a = 4
b = 10
print( a & b )

print( 12 & 100 )

# 2. 按位或
a = 5
b = 12
print( a | b )


# 3. 按位异或
a = 5
b = 12
print( a ^ b )

# 4. 按位取反
a = 5
print( ~a )

a = 6
print( ~a )

a = -5 
print( ~a )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 5. 左移
a = 5
print( a << 1) 	# a 左移1位,  先将a 转为二进制

# 分析:
# 	a = 5    ==>  	0000 0101
# 				    0000 1010   ==> 10
# 				    0001 0100   ==> 20

print( a << 2) 	# a 左移1位,  先将a 转为二进制



# 6. 右移
a = 5
print( a >> 2 )


# 分析: 
# 	a = 5  	==> 	0000 0101
# 					0000 0010 	==> 2
# 					0000 0001 	==> 1


