# 
# 成员运算符
# --------------------------
# 	1. in 		判断是否在 	指定成员容器中
# 	2. not in 	判断是否不在 指定成员容器中


# list
name = ['迪丽热巴', '古力娜扎', '马尔扎哈', '真皮沙发']

a = '古力娜扎'
print( a in name )

a = '德玛西亚'
print( a in name )
print( a not in name )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# tuple
name = ('迪丽热巴', '古力娜扎', '马尔扎哈', '真皮沙发')

a = '古力娜扎'
print( a in name )
print( a not in name )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# set
name = {'迪丽热巴', '古力娜扎', '马尔扎哈', '真皮沙发'}

a = '古力娜扎'
print( a in name )
print( a not in name )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# dict
# 	字典, 判断键 是否在 成员容器中,  不是判断值.
# 
name = {'孟祥云':'迪丽热巴', '李嘉成':'古力娜扎', '王嘉诚':'马尔扎哈', '蓝猫':'真皮沙发'}

a = '古力娜扎'
print( a in name )


a = '李嘉成'
print( a in name)
print( a not in name)





