'''
	流程控制
	1. 顺序结构: 代码从上往下依次执行
	2. 分支结构: 通过if 进行分支选择
	3. 循环结构: 通过while或for进行循环操作
'''


# 分支1
# 	格式: 
# 		if 条件: true环境
# 		
# 	规则:
# 		条件为真, 则执行true环境
# 		条件为假, 则跳过true环境
# 		
# 	分析:
# 		条件就是一个表达式, 例如: 比较, 赋值, 逻辑 ...
# 		最终条件只有两个结果: true 和 false

lv = 4
lv = 40
if lv < 6: print('青铜狗')
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')



# 分支2
# 	if 条件:
# 		true环境 (代码块)
# 
# 	
# 	代码块: 一行或者多行代码, 但不能不写

lv = 4
if lv < 6:
	print('青铜')
	print('菜鸟级别')
	print('还需要多锻炼锻炼')

print('----------------------')


# 分支3:
# 	if 条件:
# 		true环境
# 	else: 
# 		false环境
# 
# 	规则:
# 		条件为真, 则执行true环境
# 		条件为假, 则执行false环境
# 

lv = 4
lv = 2
if lv < 6:
	print('青铜狗')
else:
	print('大神')
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 分支4
# 	if 条件:
# 		true环境 (代码块)
# 	elif 条件2:
# 		true2环境 (代码块)
# 	elif 条件3:
# 		true3环境 (代码块)
# 	...
# 	
# 	多个条件满足一个即可进入代码块
# 
# 	例如: 男生挑女朋友!!
# 			长得好看吗
# 			身材好吗
# 			温柔乖巧吗
# 			姿势多吗
# 
# 	例如:
# 		农药排位
# 		
# 		lv < 6 	排青铜选手
# 		lv < 7  排白银选手
# 		lv < 8  排黄金选手
# 		lv < 9  排铂金选手
# 		剩余的   排钻石王者选手

lv = 5
lv = 6
lv = 6.8
lv = 9.5
if lv <= 6:
	print('青铜')
elif lv <= 7:
	print('白银')
elif lv <= 8:
	print('黄金')
elif lv <= 9:
	print(' 铂金')
else:
	print('钻石王者')


# 分支5







