
# 字符串格式化
# 
# %d
# %5d 	整数位数为5, 不足位补空格
# %05d 	整数位数为5, 不足位补0
# 
# %f 
# %.3f 	小数位数为3位, 不足位补0
# %.03f 小数位数为3位, 不足位补0	

print( ' 默认整数: %d ' % (123) )
print( ' 5位的整数: %5d ' % (123) )
print( ' 5位的整数: %05d ' % (123) )
print( ' 默认浮点: %f ' % (123.456789) )
print( ' 默认浮点: %.3f ' % (123.456789) )
print( ' 默认浮点: %.3f ' % (123.4) )
print( ' 默认浮点: %.03f ' % (123.4) )


# 字典
# 	dict(x)

# print( dict(   [值1, 值2, 值3]   )  )  
print( dict(   [[1,2], [3,4], [5,6]]   )  )  
print( dict(   [(1,2), (3,4), (5,6)]   )  )  
print( dict(   [{1,2}, {3,4}, {5,6}]   )  )  
print( dict(   {1:2, 3:4, 5:6}         )  )



