'''
	数学模块
'''

# 3. math模块

import math


a = 3.5
a = 3.2
a = 3.0

b = math.ceil(a) 	# 进一取整, 小数位只要不是0, 都会进1
b = math.floor(a) 	# 舍一取整, 无论小数是几, 都直接抛弃, 只留下整数
print(b)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


a = math.pow(2,3) 	# 开次方, 开2的3次方
a = math.sqrt(9) 	# 开平方根
a = math.fabs(-3.5) # 获取绝对值
a = math.modf(5.87) # 以元组形式存储 小数位 和 整数位 
print(a, type(a))
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


a = [1,2,3]
a = (1,2,3)
a = {1,2,3}
a = {1:2,3:4}
# a = '1234'

b = math.fsum(a) 	# 计算序列值 和
print(b, type(b))
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


a = -5
b = 3
c = math.copysign(a,b) # 将第二个值的符号 拷贝给 第一个值
c = math.copysign(b,a)
print(c)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


a = math.pi 	# 圆周率
a = math.e 		# 自然底数 e
print(a)

