

class Book():
	def __init__(self):
		print('3')

	def __del__(self):
		print('666')


# a = Book()
# 3 666
# --------------------------------------------------


# a = Book()
# a = Book()
# --------------------------------------------------

# 分析:
# 	1) 执行 16行的 Book()
# 	2) 调用 init,  输出3
# 	3) 返回对象 给 老a 		[ 内存中有两个值, 一个a,  一个Book类]
# 	4) 执行 17行的 Book()
# 	5) 调用 init,  输出3
# 	6) 返回对象 给 新a,  覆盖了老a, 覆盖老a时, 老a的析构就被触发了, 输出 666
# 	7) 程序结束, 新a 被销毁了,  新a 的析构被触发了, 输出 666
# --------------------------------------------------


a = Book()
a = Book()
a = Book()

