'''
	循环结构
		for循环
'''

# 循环1
# 	for 变量 in 容器:
# 		代码块
# 
# 	容器: list, tuple, set, dict
# 	这里也可以填 string
# 	
# 	变量 会一次获取容器中一个值

# 字符串
a = '貂蝉王昭君西施杨玉环'
for i in a:
	print(i) 	# string中, 每一次的循环, 能获取其中一个字

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 列表
a = ['貂蝉', '王昭君', '西施', '杨玉环']
for i in a:
	print(i)

print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 字典
a = {'貂蝉':'吕布', '王昭君':'蓝猫', '西施':'范蠡', '杨玉环':'李隆基'}
for i in a:
	print(' 今天 %s 由 %s 来侍寝  ' % ( a[i]  ,i  ) )

# 键  通过 i 来获取
# 值  通过 字典名[键]  来获取值





