# 数字循环练习
# 
#
# 练习1:
# 	求出 1~100 之间所有的偶数

for i in range(1,101):
	if i % 2 == 0:
		print(i, end=" ")

print('\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

for i in range(0,101,2):
	print(i, end=" ")

print('\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

# 优化算法
for i in range(1,51):
	print(i*2, end=" ")

print('\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 练习2:
# 	计算 1-100 之间所有的偶数和
sum = 0
for i in range(1,101):
	if i % 2 == 0:
		sum+=i
print(sum)








# 练习3:
# 	求出 153 的个位数, 十位数, 百位数

num = 153

a = num // 100  # int(num/100) 	# 百位
b = (num % 100) // 10 			# 十位
c = num % 10 					# 个位
print(a, b, c)

# 分析:	
# 	除以100, 保留百位
# 	除以10,  保留十位
# 	
# 	模100, 	除了百位, 都保留
# 	模10, 	除了十位, 都保留

# 练习4: 
# 	求 100 ~ 999 之间的所有水仙花数
# 	
# 	水仙花数: 
# 		本身 = 个位的3次方 +  十位的3次方 +  百位的3次方 
# 	
# 		153 = 1**3 + 5**3 + 3**3
# 		
for i in range(100,1000):
	a = i // 100
	b = (i % 100) // 10
	c = i % 10
	if a**3 + b**3 + c**3 == i:
		print(i)

a = 90
print(a<<20)




