'''
    格式化函数:
        按照指定格式进行操作
'''

# 1. 基础用法
#   {} 从前向后依次对应参数
a = '{},{},{}高高兴兴牵着手, 一起冲向女厕所'

print(a)
print(a.format('熊大', '熊二', '光头强')  )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 2. 索引格式化
# 	{0} 	只接收索引为0 的参数
# 	{1} 	只接收索引为1 的参数
# 	...
# 	{n} 	只接收索引为n 的参数
a = '{0},{1},{2}高高兴兴牵着手, 一起冲向女厕所'
a = '{2},{1},{0}高高兴兴牵着手, 一起冲向女厕所'
a = '{1},{2},{0}高高兴兴牵着手, 一起冲向女厕所'

print(a.format('熊大', '熊二', '光头强')  )
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 3. 关键字格式化
a  = '{name}头顶{pro1}, 身披{pro2}, 脚踩{pro3}, 吾称屌丝二代'
print(a.format(name='狗蛋', pro1='锅盖', pro2='麻袋', pro3='白菜'))
print(a.format(pro1='锅盖', pro2='麻袋', pro3='白菜', name='狗蛋'))


# 4. 索引, 关键字混合
# 	索引位置 必须对应好
# 	关键字位置随意, 但不能影响索引
# 
a  = '{0}头顶{1}, 身披{pro2}, 脚踩{pro3}, 吾称屌丝二代'
print( a.format('二狗', '锅盖', pro2='麻袋', pro3='白菜'   )  )
# print( a.format( pro2='麻袋', pro3='白菜', '二狗', '锅盖')  )
print( a.format('二狗', '锅盖', pro3='白菜', pro2='麻袋'   )  )


# 5. 格式限定符
# 	{a:bcd}
# 	a: 索引/关键字
# 	b: 填充符号 			默认 空字符串
# 	c: 对齐符号 			左<  右>  居中^
# 	d: 总长度
# 	
# 	如果a 比 d 还长, 那么bc就看不出来, 以实际a 的长度为准
# 	如果a 比 d 还小, 那么不够的长度用b来填


a = '吕布带了很大很大的{color:"^2}{thing:>10}'
print( a.format(color='红色的', thing='帽子')  )


# 6. 进制限定
#  	b: 二进制
#  	o: 八进制
#  	d: 十进制
#  	x: 十六进制
#  	
#  	格式: {:b}
#  	格式: {:o}
#  	格式: {:d}
#  	格式: {:x}

a = '八戒大约体重{:d}斤' 	# 将200 转成十进制
a = '八戒大约体重{:b}斤' 	# 将200 转成二进制
a = '八戒大约体重{:o}斤' 	# 将200 转成八进制
a = '八戒大约体重{:x}斤' 	# 将200 转成十六进制
print(a.format(200))
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


# 7. 精度限定
#  	格式: {:.num}  	整数+小数 一共num位
#  	格式: {:.numf} 	小数	  	 一共num位
#  	
#  	注意点:
#  		冒号 后面有一个 小数点

a = '圆周率: {:.5}'
a = '圆周率: {:.5f}'
print(a.format(3.141592652))


# 8. 千分位
#  	, 每隔3位加一个逗号
a = '马云身价${:,}'
print(a.format(10000000000000))



















