'''
	字典
	1. 定义
	2. 格式
	3. 基本操作
	4. 遍历字典
	5. 字典推导式
'''


# 5. 字典推导式
# 	与列表推导式相似
# 	
# 	5.1 基本推导式
# 	5.2 条件推导式
# 	5.3 多循环推导式
# 	5.4 多循环条件推导式



# 5.1 基本推导式
# 	格式:  { 键:值 for 键,值 in 字典.items() }
# 	
# 需求:
# 	以下列格式进行是输出
# 	绰号=xxx  大名=xxx

a = {'赵小刀':'赵丽颖', '小笼包':'陈妍希', '胖迪':'迪丽热巴'}
b = { '绰号='+k  : '大名='+v for k,v in a.items() }
print(b)



# 5.2 条件推导式
# 	格式:  { 键:值 for 键,值 in 字典.items() if 条件 }

# 需求:
# 	只显示名字长度为4位的人 
a = {'赵小刀':'赵丽颖', '小笼包':'陈妍希', '胖迪':'迪丽热巴'}
b = { k:v for k,v in a.items() if len(v) == 4 }
print(b)


# 5.3 多循环推导式
# 	格式:  { 键:值 for 键1,值1 in 字典1.items() for 键2,值2 in 字典2.items() }


# 需求: 
# 	凑CP
a = {'赵小刀':'赵丽颖', '小笼包':'陈妍希'}
b = {'小旋风':'林志颖', '黑旋风':'李逵'}

c = { v1:v2 for k1,v1 in a.items()  for k2,v2 in b.items()}
print(c) 	# 感觉少了点人, 原因: 键必须保持唯一, 导致后面的键 覆盖前面的键


# 5.3 多循环条件推导式
# 	格式:  { 键:值 for 键1,值1 in 字典1.items() for 键2,值2 in 字典2.items() if 条件}
a = {'赵小刀':'赵丽颖', '胖迪':'迪丽热巴'}
b = {'小旋风':'林志颖', '黑旋风':'李逵'}
c = { v1:v2 for k1,v1 in a.items()  for k2,v2 in b.items() if len(v1)!=4 and len(v2)!=4}
print(c)


